БИТУправление_медицинским_центром_демо/src/InformationRegisters/НормыРасходаМатериалов/НормыРасходаМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыРасходаМатериалов</name>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ВходитВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Производственная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДляВнешнегоПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбщийРасходНаУслугиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЗависитОтКоличестваУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаМатериала</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НормыРасходаМатериалов/Forms/ФормаЗаписиУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда
		Элементы.Номенклатура.Доступность = Ложь;
		Элементы.ХарактеристикаНоменклатуры.Видимость	= УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВестиУчетПоХарактеристикам")
														И Параметры.ЗначенияЗаполнения.Номенклатура.ВестиУчетПоХарактеристикам;
	Иначе
		Элементы.ХарактеристикаНоменклатуры.Видимость	= УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВестиУчетПоХарактеристикам")
														И Запись.Номенклатура.Пустая() Или Запись.Номенклатура.ВестиУчетПоХарактеристикам;	
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Запись.ВходитВСтоимость = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВключатьНормативныеМатериалыВСтоимостьУслуг");
	КонецЕсли;
	
	Элементы.ХарактеристикаМатериала.Видимость		= УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВестиУчетПоХарактеристикам");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МатериалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Материал) Тогда
		МатериалПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура МатериалПриИзмененииСервер()
	
	Если Запись.ЕдиницаИзмерения.Пустая() Или 
		Запись.ЕдиницаИзмерения.Владелец <> Запись.Материал
	Тогда
	    Запись.ЕдиницаИзмерения = Запись.Материал.ЕдиницаХраненияОстатков;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
